In [2]:
import numpy as np
import pandas as pd

In [3]:
# Если хотим вызвать помощь о каком-то методе:
np.set_printoptions?  # или help(np.set_printoptions)

SyntaxError: invalid syntax (<ipython-input-3-4b4f5407b5f8>, line 2)

In [5]:
data = pd.read_csv('./data/beauty.csv', sep=';') # данные разделены ";" вместо обычного разделителя ","

In [6]:
type(data)

pandas.core.frame.DataFrame

In [7]:
data.head()  # head() - показывает первые 5 позиций

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [ ]:
data.shape # размеры

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [22]:
data.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

In [24]:
type(data['wage'])

pandas.core.series.Series

In [25]:
data['wage'].head()

0     5.73
1     4.28
2     7.96
3    11.57
4    11.42
Name: wage, dtype: float64

# loc, iloc

In [26]:
data.loc[0:5, ['wage', 'female']]

    wage  female
0   5.73       1
1   4.28       1
2   7.96       1
3  11.57       0
4  11.42       0
5   3.91       1

In [28]:
data.iloc[:, 2:4].head()

   union  goodhlth
0      0         1
1      0         1
2      0         1
3      0         1
4      0         1

**Boolean masks**

In [38]:
(data['female'] == 1).head()

0     True
1     True
2     True
3    False
4    False
Name: female, dtype: bool

In [40]:
data[data['female'] == 1].head()

   wage  exper  union  goodhlth  black  female  married  service  educ  looks
0  5.73     30      0         1      0       1        1        1    14      4
1  4.28     28      0         1      0       1        1        0    12      3
2  7.96     35      0         1      0       1        0        0    10      4
5  3.91     20      0         0      0       1        1        0    12      3
8  5.00      5      0         1      0       1        0        0    16      3

In [42]:
data[data['female'] == 1]['wage'].head()

0    5.73
1    4.28
2    7.96
5    3.91
8    5.00
Name: wage, dtype: float64

In [43]:
data[data['female'] == 1]['wage'].mean()

4.299357798165137

In [45]:
data[data['female'] == 1]['wage'].mean(), \
data[data['female'] == 0]['wage'].mean()

(4.299357798165137, 7.3688228155339806)

**Определим какие мужчины больше зарабатывают: женатые или холостые**

In [51]:
data[(data['female'] == 0) & (data['married'] == 1)].head() # отбираем женатых, но показываем первых 5

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
3,11.57,38,0,1,0,0,1,1,16,3
4,11.42,27,0,1,0,0,1,0,16,3
6,8.76,12,0,1,0,0,1,0,16,3
11,4.03,6,0,1,0,0,1,0,16,4
12,5.14,19,0,1,0,0,1,1,17,2

In [54]:
data[(data['female'] == 0) & (data['married'] == 1)]['wage'].median(), \
data[(data['female'] == 0) & (data['married'] == 0)]['wage'].median()

(6.710000000000001, 5.0649999999999995)

**groupby**

In [56]:
# У нас есть рейтинг привлекательности(looks), можно смотреть признаки отдельно для людей с разным рейтингом привлекательности.

In [57]:
data.groupby('looks')

In [58]:
for i in data.groupby('looks'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [59]:
# в каждом кортеже лежит - уникальное значение признака и подвыборка, где все значения этого уникального признака.

In [63]:
for look, sub_df in data.groupby('looks'):
    print(look)

1
2
3
4
5

In [67]:
for look, sub_df in data.groupby('looks'):
    print(sub_df.head())

      wage  exper  union  goodhlth  black  female  married  service  educ  \
28    8.35     41      0         0      0       0        1        1    16
200   3.75     36      0         1      0       0        0        0    12
248  10.99     40      0         1      0       0        1        0    12
327   1.65     24      0         1      0       1        0        1    13
751   7.93     39      1         1      0       0        1        0    12

     looks
28       1
200      1
248      1
327      1
751      1
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
12  5.14     19      0         1      0       0        1        1    17      2
33  8.17     18      0         1      0       0        1        0    16      2
35  9.62     37      0         1      0       0        1        0    13      2
37  7.69     10      1         1      0       0        1        0    13      2
57  6.56     17      0         1      0       0        1        0    13      2
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
1   4.28     28      0         1      0       1        1        0    12      3
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3
5   3.91     20      0         0      0       1        1        0    12      3
6   8.76     12      0         1      0       0        1        0    16      3
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
2   7.96     35      0         1      0       1        0        0    10      4
7   7.69      5      1         1      0       0        0        0    16      4
10  3.45      3      0         1      0       1        0        0    12      4
11  4.03      6      0         1      0       0        1        0    16      4
      wage  exper  union  goodhlth  black  female  married  service  educ  \
26   14.84     29      0         1      0       0        0        1    13
27   19.08     17      0         1      0       0        0        0    17
76   23.32     15      0         1      0       0        1        1    17
112   6.11      7      0         1      0       1        1        0    12
316   3.92     12      0         1      0       0        1        1    12

     looks
26       5
27       5
76       5
112      5
316      5

In [69]:
for look, sub_df in data.groupby('looks'):
    print(look)
    print(sub_df['female'].mean())   # доля женщин для каждого пункта рейтинга

1
0.38461538461538464
2
0.38028169014084506
3
0.32271468144044324
4
0.37362637362637363
5
0.42105263157894735

In [71]:
for look, sub_df in data.groupby(['looks', 'female']):   # если группировать не по одному признаку а по нескольким
    print(look)

(1, 0)
(1, 1)
(2, 0)
(2, 1)
(3, 0)
(3, 1)
(4, 0)
(4, 1)
(5, 0)
(5, 1)

In [70]:
# категориальный признак - это признак, у которого множество значений не бесконечно, looks - у него 5 уникальных значений.
# Т.е. по значениям категориальных признаков можно итерироваться с помощью groupby

In [72]:
data.groupby('looks')[['wage', 'exper']].agg(np.median)

        wage  exper
looks
1      3.460   32.0
2      4.595   18.0
3      5.635   18.0
4      5.240   12.5
5      4.810    8.0

In [73]:
# Взаимосвязи. Допустим, я хочу посмотреть как связаны признаки 'female' и 'married':

In [74]:
pd.crosstab(data['female'], data['married'])

married    0    1
female
0        166  658
1        223  213

In [8]:
pd.crosstab(data['female'], data['looks'])

looks   1   2    3    4   5
female
0       8  88  489  228  11
1       5  54  233  136   8

**Поделим людей на бедных и богатых**

In [10]:
data['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [12]:
# заметим, что 75% людей зарабатывают меньше 7.7$ в час. Разделим всех по порогу в 7.7$/час. 
# Для этого создадим новый признак "is_rich"

In [19]:
data['wage'].quantile(.75)

7.695

In [20]:
(data['wage'] > data['wage'].quantile(.75)).head()

0    False
1    False
2     True
3     True
4     True
Name: wage, dtype: bool

In [21]:
(data['wage'] > data['wage'].quantile(.75)).astype('int64').head()

0    0
1    0
2    1
3    1
4    1
Name: wage, dtype: int64

In [22]:
data['is_rich'] = (data['wage'] > data['wage'].quantile(.75)).astype('int64')

In [23]:
data.head()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks,is_rich
0,5.73,30,0,1,0,1,1,1,14,4,0
1,4.28,28,0,1,0,1,1,0,12,3,0
2,7.96,35,0,1,0,1,0,0,10,4,1
3,11.57,38,0,1,0,0,1,1,16,3,1
4,11.42,27,0,1,0,0,1,0,16,3,1

**Применение функции к каждому столбцу:**

In [26]:
data.apply(np.mean) # применим через apply() какую-то функцию ко всему DataFrame

wage         6.306690
exper       18.206349
union        0.272222
goodhlth     0.933333
black        0.073810
female       0.346032
married      0.691270
service      0.273810
educ        12.563492
looks        3.185714
is_rich      0.250000
dtype: float64

In [27]:
# Допустим, я хочу завести строковый признак(мужчина/женщина) на основе бинарного признака 'female'

In [29]:
def string_gender(female):
    return 'female' if female else 'male'

In [30]:
string_gender(0)

'male'

In [31]:
string_gender(1)

'female'

In [33]:
data['female'].apply(string_gender).head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object

In [34]:
# Тоже самое можно сделать через лямбда-функцию:

In [36]:
data['female'].apply(lambda female: 'female' if female else 'male').head()

0    female
1    female
2    female
3      male
4      male
Name: female, dtype: object

In [37]:
d = {1: 'union', 0: 'non-union'}

In [38]:
data['union'].map(d).head()

0    non-union
1    non-union
2    non-union
3    non-union
4    non-union
Name: union, dtype: object